---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedRunInvalidPath
source: html/2c06174b-9506-2066-d327-9014b8e3454e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedRunInvalidPath Property

Invalid stair path. Stair path should connect both start and end riser, and cross all other risers.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchedRunInvalidPath { get; }
```